#Доработайте hello.py, чтобы помимо "Привет мир!" она выводила на экран при помощи print:
#Cтроку "Привет программист!"
#Результат действия 2 + 2
#Результат действия 10 / 3


print("Привет, программист!")
print(2+2)
print(10/3)


#Создайте в редакторе файл hello.py, в котором будет переменная name с вашим именем
#Сделайте так, чтобы при запуске скрипта значение переменной выводилось на экран
#Запустите скрипт

name = 'Alex'
print(name)